'''1. Вычислить число π c заданной точностью d

Пример:

- при d = 3, π = 3.141
'''


d = int(input("Введите число: "))
k = 1
pi = 0
for i in range ( 1000000 ):
    if i % 2 == 0 :
        pi += 4 / k
    else :
        pi -= 4 / k
    k += 2

print (f"Число π: {round (pi,d)}")